tests/requests/get-bugs.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/1999/XMLSchema-instance" xmlns:xsd="http://www.w3.org/1999/XMLSchema" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" soapenc:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"><soap:Body><ns1:get_bugs xmlns:ns1="urn:Debbugs/SOAP" soapenc:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"><ns1:query xsi:type="soapenc:Array" soapenc:arrayType="xsd:anyType[4]"><ns1:query xsi:type="xsd:string">package</ns1:query><ns1:query xsi:type="xsd:string">guix-patches</ns1:query><ns1:query xsi:type="xsd:string">package</ns1:query><ns1:query xsi:type="xsd:string">guix</ns1:query></ns1:query></ns1:get_bugs></soap:Body></soap:Envelope>
