tests/requests/get-status.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/1999/XMLSchema-instance" xmlns:xsd="http://www.w3.org/1999/XMLSchema" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" soapenc:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"><soap:Body><ns1:get_status xmlns:ns1="urn:Debbugs/SOAP" soapenc:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"><ns1:bugs xsi:type="soapenc:Array" soapenc:arrayType="xsd:int[3]"><ns1:bugs xsi:type="xsd:int">1</ns1:bugs><ns1:bugs xsi:type="xsd:int">2</ns1:bugs><ns1:bugs xsi:type="xsd:int">3</ns1:bugs></ns1:bugs></ns1:get_status></soap:Body></soap:Envelope>
